Revit 2026 API

# RailExtensionStyle Enumeration

---

The extension style of the rail.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailExtensionStyle
```
```vb
Public Enumeration RailExtensionStyle
```
```cpp
public enum class RailExtensionStyle
```
```fsharp
type RailExtensionStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Floor | 2 | The rail extends to floor. |
| None | 0 | The rail extends to nothing |
| Post | 3 | The rail extends to post. |
| Wall | 1 | The rail extends to wall. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace